hello_message_text = 'Привет, Я Idea_Gen_Bot 🤖!'
start_message_text = (
    'Этот бот создан для генирации научных идей.\n\n'
    'Для начала генирации необходимо описать:\n'
    'Агентов, которые будут обсуждать идею.\n'
    'Тему их диалога.\n'
    'При необходимости выбрать модель.\n'
    'После чего можно начать генирацию обсуждения.\n\n'
    'Все это можно сделать используя интерактивные кнопки.\n'
)
button_text_gen_menu = 'Меню геринации'
button_text_agents = 'Задать агентов'
button_text_theme = 'Задать тему диалога'

button_text_gen = 'Генирация далога'
button_text_add_replica = 'Добавить реплику'
button_text_result = 'Подведение итогов'
button_back_text = "<< Назад"

text_for_agent = 'Введите агентов в формате:\nТексты, разделенные [AGENT_NAME], описания агентов, где AGENT_NAME - уникальные имена агентов.'
text_for_dialog_len = 'Введите длину диалога\nПоложительное целое число, количество реплик каждого агента.'
text_for_theme = 'Введите тему диалога ботов, в свободной форме.'
text_for_gen = 'Идет обсуждение, пожалуйста подождите'
text_for_add_replica = 'Добавьте реплику'


